Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes.ScalingMethod Property
 The print scaling method.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DotPrintScalingType ScalingMethod { get; set; }
Public Property ScalingMethod As DotPrintScalingType
	Get
	Set
Property Value
Type: DotPrintScalingType
See Also
Reference
DPMPrinterAttributes Class
Tekla.Structures.Drawing Namespace